src/Enums/MessageStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>MessageStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NoStatus</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Information</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonForms/MessageBox/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisForm.Title = Parameters.Title;
	If Parameters.MessageStatus = Enums.MessageStatus.NoStatus Then
		Items.MessageIcon.Visible = False;
	ElsIf Parameters.MessageStatus = Enums.MessageStatus.Information Then
		Items.MessageIcon.Picture = PictureLib.Information32;
	ElsIf Parameters.MessageStatus = Enums.MessageStatus.Warning Then
		Items.MessageIcon.Picture = PictureLib.Warning32;
	EndIf;
	Items.Message.Title = Parameters.Message;
EndProcedure
